Revit 2026 API

# AnalysisDisplayStyleGetDiagramSettings Method

---

Get diagram settings object from the style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AnalysisDisplayDiagramSettings GetDiagramSettings()
```
```vb
Public Function GetDiagramSettings As AnalysisDisplayDiagramSettings
```
```cpp
public:
AnalysisDisplayDiagramSettings^ GetDiagramSettings()
```
```fsharp
member GetDiagramSettings : unit -> AnalysisDisplayDiagramSettings
```

#### Return Value

AnalysisDisplayDiagramSettings

| Exception | Condition |
| --- | --- |
| InvalidOperationException | diagram settings were not created with the object. |

#### Reference

AnalysisDisplayStyle Class

Autodesk.Revit.DB.Analysis Namespace